{
  "title": "Office Party Days After Plane Crash, Air India Venture Sacks 4 Senior Staff",
  "content": "Four senior employees of Air India's airport gateway services provider AISATS have been told to resign after a video showing employees partying in the workplace went viral on social media. The party at AISATS' Gurugram office was reportedly organised just days after the Air India Boeing 787-8 Dreamliner crash in Ahmedabad that killed 259 people. An AISATS spokesperson said the company stands in solidarity with the families affected by the tragic loss of flight AI 171, and expressed regret over the \"internal video\", which was seen by many on social media as a time not appropriate for celebrations. \"At AISATS, we stand in solidarity with families affected by the tragic loss of AI 171 and deeply regret the lapse in judgment reflected in a recent internal video,\" the spokesperson said. \"The behaviour does not align with our values, and firm disciplinary action has been taken against those responsible as we reaffirm our commitment to empathy, professionalism, and accountability,\" the spokesperson said. The company said it has asked four senior officials to go and warned many others. AISATS is a 50-50 joint venture between Air India Ltd, which is part of the Tata Group, and SATS Ltd, a player in gateway services and food solutions. The Boeing Dreamliner bound for London on June 12 started losing altitude and crashed seconds after the take-off. It slammed into a residential campus of BJ Medical College in Meghani Nagar, located just outside the airport perimeter. Only one passenger out of the 242 on board -- an Indian-origin British national seated in seat 11A -- survived.",
  "source": "NDTV",
  "url": "https://www.ndtv.com/india-news/office-party-days-after-air-india-boeing-787-crash-aisats-sacks-4-senior-employees-8777266",
  "published_date": "Fri, 27 Jun 2025 18:40:27 +0530",
  "author": "NDTV News Desk",
  "category": "India News",
  "language": "en",
  "scraped_at": "2025-06-28T10:30:44.627581",
  "status": "success"
}